Revit 2024 API
SpecTypeId.Current Property
 Current, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId Current { get; }
Visual Basic
Public Shared ReadOnly Property Current As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Current {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace